# Introducción a la programación - cap. 5

In [2]:
try:
    import pandas as pd
    print("Libreria: 'pandas' esta instalada y se cargo correctamente")
except ModuleNotFoundError:
    print("Libreria: 'pandas' no esta instalada, se debe instalar")
    !pip install pandas
    import pandas as pd

Libreria: 'pandas' esta instalada y se cargo correctamente

In [3]:
try:
    import numpy as np 
    print("Libreria: 'numpy' esta instalada y se cargo correctamente")
except ModuleNotFoundError:
    print("Libreria: 'numpy' no esta instalada, se debe instalar")
    !pip install numpy
    import numpy as np

Libreria: 'numpy' esta instalada y se cargo correctamente

In [4]:
def load_file(excel_file_name, excel_sheet_name_list, excel_num_head):
    tmp_Data_Frame = pd.read_excel(excel_file_name, 
                                   header = excel_num_head, 
                                   sheet_name = excel_sheet_name_list,
                                   dtype={'Mes': str},
                                   verbose=True)
    return tmp_Data_Frame

In [5]:
bfFileName = ['LLL.xlsx', 'lll', '0']

In [6]:
df = load_file('./data/' + bfFileName[0] , bfFileName[1], int(bfFileName[2]))

Reading sheet lll

### Como consultar lo que se cargo en memoria

In [7]:
df.head(3)

     Yacimiento  rama_hrz_m  ctd_fracturas  arena_tn  agua_m3
0  Loma la Lata       891.3             10   2250.32  16332.4
1  Loma la Lata       901.3             10   2214.63  14292.0
2  Loma la Lata       820.3             11   2220.80  14108.2

### Aplicar una funcion a todo el dataframe

In [8]:
(df.round(1)).head()

     Yacimiento  rama_hrz_m  ctd_fracturas  arena_tn  agua_m3
0  Loma la Lata       891.3             10    2250.3  16332.4
1  Loma la Lata       901.3             10    2214.6  14292.0
2  Loma la Lata       820.3             11    2220.8  14108.2
3  Loma la Lata       815.1             10    1279.1  10295.9
4  Loma la Lata       285.3              4     681.9   3630.2

### Como obtener la información de un dataframe

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181 entries, 0 to 180
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Yacimiento     181 non-null    object
 1   rama_hrz_m     181 non-null    float64
 2   ctd_fracturas  181 non-null    int64
 3   arena_tn       181 non-null    float64
 4   agua_m3        181 non-null    float64
dtypes: float64(3), int64(1), object(1)
memory usage: 7.2+ KB

### Como obtener la información de los campos numéricos

In [10]:
df.describe()

        rama_hrz_m  ctd_fracturas     arena_tn       agua_m3
count   181.000000     181.000000   181.000000    181.000000
mean   1622.295525      21.033149  4601.358343  26639.722799
std     524.428179       7.591589  1760.378885  13457.301495
min     284.800000       4.000000   681.890000   3630.200000
25%    1372.500000      18.000000  3508.070000  17212.800000
50%    1439.800000      18.000000  4277.390000  21436.400000
75%    2054.300000      26.000000  5662.670000  37045.200000
max    3158.300000      41.000000  9591.120000  71700.200000

### Como saber cuantos valores distintos tengo

In [11]:
df.nunique(axis=0)

Yacimiento         2
rama_hrz_m       164
ctd_fracturas     34
arena_tn         179
agua_m3          181
dtype: int64

### Como saber que se tienen campos en nulo

In [12]:
df.isnull().sum()

Yacimiento       0
rama_hrz_m       0
ctd_fracturas    0
arena_tn         0
agua_m3          0
dtype: int64

### Como seleccionar algunas columnas en un nuevo dataframe

In [13]:
df_Reduced = df[['Yacimiento', 'rama_hrz_m','ctd_fracturas']]

In [14]:
df_Reduced.head(3)

     Yacimiento  rama_hrz_m  ctd_fracturas
0  Loma la Lata       891.3             10
1  Loma la Lata       901.3             10
2  Loma la Lata       820.3             11

### Ver info of tipo de campo

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181 entries, 0 to 180
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Yacimiento     181 non-null    object
 1   rama_hrz_m     181 non-null    float64
 2   ctd_fracturas  181 non-null    int64
 3   arena_tn       181 non-null    float64
 4   agua_m3        181 non-null    float64
dtypes: float64(3), int64(1), object(1)
memory usage: 7.2+ KB

In [16]:
df.select_dtypes(include = ['float']).head(3)

   rama_hrz_m  arena_tn  agua_m3
0       891.3   2250.32  16332.4
1       901.3   2214.63  14292.0
2       820.3   2220.80  14108.2

In [17]:
df.select_dtypes(include = ['int64']).head(3)

   ctd_fracturas
0             10
1             10
2             11

### Como cambiar el orden de las columnas

In [18]:
df_OrderNew = df[['Yacimiento', 'ctd_fracturas', 'rama_hrz_m', 'arena_tn', 'agua_m3']]

In [19]:
df_OrderNew.head(3)

     Yacimiento  ctd_fracturas  rama_hrz_m  arena_tn  agua_m3
0  Loma la Lata             10       891.3   2250.32  16332.4
1  Loma la Lata             10       901.3   2214.63  14292.0
2  Loma la Lata             11       820.3   2220.80  14108.2

### Diversos tipos de busqueda en el dataframe

In [20]:
df.loc[df['ctd_fracturas'] == 10]

      Yacimiento  rama_hrz_m  ctd_fracturas  arena_tn  agua_m3
0   Loma la Lata       891.3             10   2250.32  16332.4
1   Loma la Lata       901.3             10   2214.63  14292.0
3   Loma la Lata       815.1             10   1279.13  10295.9
7   Loma la Lata      1087.8             10   2276.82   9982.0
97  Loma Campana       934.3             10   2228.72  17456.3

In [21]:
df['ctd_fracturas'] == 10

0       True
1       True
2      False
3       True
4      False
       ...
176    False
177    False
178    False
179    False
180    False
Name: ctd_fracturas, Length: 181, dtype: bool

In [22]:
df.loc[df['ctd_fracturas'] != 10].head(5)

     Yacimiento  rama_hrz_m  ctd_fracturas  arena_tn   agua_m3
2  Loma la Lata       820.3             11   2220.80  14108.20
4  Loma la Lata       285.3              4    681.89   3630.20
5  Loma la Lata      1131.7             14   3115.53  14075.62
6  Loma la Lata      1112.9             14   3167.51  14130.70
8  Loma la Lata      1197.9             15   3702.15  17112.00

In [23]:
df.loc[df['ctd_fracturas'].isin([10])]

      Yacimiento  rama_hrz_m  ctd_fracturas  arena_tn  agua_m3
0   Loma la Lata       891.3             10   2250.32  16332.4
1   Loma la Lata       901.3             10   2214.63  14292.0
3   Loma la Lata       815.1             10   1279.13  10295.9
7   Loma la Lata      1087.8             10   2276.82   9982.0
97  Loma Campana       934.3             10   2228.72  17456.3

In [24]:
df.loc[df['ctd_fracturas'].isin([10,11,12])]

       Yacimiento  rama_hrz_m  ctd_fracturas  arena_tn       agua_m3
0    Loma la Lata       891.3             10   2250.32  16332.400000
1    Loma la Lata       901.3             10   2214.63  14292.000000
2    Loma la Lata       820.3             11   2220.80  14108.200000
3    Loma la Lata       815.1             10   1279.13  10295.900000
7    Loma la Lata      1087.8             10   2276.82   9982.000000
97   Loma Campana       934.3             10   2228.72  17456.300000
117  Loma Campana       942.3             12   2727.14  11479.214894

In [25]:
df.loc[(df['ctd_fracturas'] >= 10) & (df['ctd_fracturas'] <= 12)]

       Yacimiento  rama_hrz_m  ctd_fracturas  arena_tn       agua_m3
0    Loma la Lata       891.3             10   2250.32  16332.400000
1    Loma la Lata       901.3             10   2214.63  14292.000000
2    Loma la Lata       820.3             11   2220.80  14108.200000
3    Loma la Lata       815.1             10   1279.13  10295.900000
7    Loma la Lata      1087.8             10   2276.82   9982.000000
97   Loma Campana       934.3             10   2228.72  17456.300000
117  Loma Campana       942.3             12   2727.14  11479.214894

In [26]:
df.query('ctd_fracturas == 10')

      Yacimiento  rama_hrz_m  ctd_fracturas  arena_tn  agua_m3
0   Loma la Lata       891.3             10   2250.32  16332.4
1   Loma la Lata       901.3             10   2214.63  14292.0
3   Loma la Lata       815.1             10   1279.13  10295.9
7   Loma la Lata      1087.8             10   2276.82   9982.0
97  Loma Campana       934.3             10   2228.72  17456.3

In [27]:
%timeit mask = df.loc[df['ctd_fracturas'].isin([10,11,12])]
%timeit mask = df.loc[(df['ctd_fracturas'] >= 10) & (df['ctd_fracturas'] <= 12)]

358 µs ± 4.66 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)
641 µs ± 22.5 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [28]:
df[df['Yacimiento'].str.contains("Campana")].head(5)

       Yacimiento  rama_hrz_m  ctd_fracturas  arena_tn  agua_m3
97   Loma Campana       934.3             10   2228.72  17456.3
98   Loma Campana      1401.5             19   3718.67  19978.6
99   Loma Campana      1197.5             15   3292.65  15950.4
100  Loma Campana      1094.3             15   3620.52  11836.0
101  Loma Campana      1198.6             15   3720.24  14301.0

In [29]:
df[df['Yacimiento'].str.contains(r'Loma(?!$)')]

       Yacimiento  rama_hrz_m  ctd_fracturas  arena_tn    agua_m3
0    Loma la Lata       891.3             10   2250.32  16332.400
1    Loma la Lata       901.3             10   2214.63  14292.000
2    Loma la Lata       820.3             11   2220.80  14108.200
3    Loma la Lata       815.1             10   1279.13  10295.900
4    Loma la Lata       285.3              4    681.89   3630.200
..            ...         ...            ...       ...        ...
176  Loma Campana      2454.3             38   9064.40  53371.200
177  Loma Campana      2455.3             38   8575.09  53135.765
178  Loma Campana      2478.3             39   8862.35  53827.000
179  Loma Campana      2385.3             38   8658.09  53143.900
180  Loma Campana      2300.3             37   8405.10  51529.000

[181 rows x 5 columns]

In [30]:
df['Yacimiento'].str.contains(r'Loma(?!$)').sum()

181

In [31]:
import sweetviz as sv

In [32]:
my_report = sv.analyze(df)

:FEATURES DONE:                    |                     | [  0%]   00:03  -> (00:00 left)
:PAIRWISE DONE:                    |█████████████████████| [100%]   00:00  -> (00:00 left)

Creating Associations graph... DONE!

In [40]:
my_report.show_html()

In [38]:
df1 = sv.compare(df[97:], df[:97])

:FEATURES DONE:                    |                     | [  0%]   00:01  -> (00:00 left)
:PAIRWISE DONE:                    |█████████████████████| [100%]   00:00  -> (00:00 left)

Creating Associations graph... DONE!

In [41]:
df1.show_html('Compare.html')

______________